package Les4List;

/*
1. Создать массив с набором слов (10-20 слов, должны встречаться повторяющиеся).
Найти и вывести список уникальных слов, из которых состоит массив (дубликаты не считаем).
Посчитать, сколько раз встречается каждое слово.
*/

public class MainTask<T> {
    public static void main(String[] args) {
//  Работает. Для проверки раскоментить.
// Вопрос Слава (Просьба ответить на лекции всем): почему мне пришлось закоменить первое задание в Main, чтобы запустить второе про справочник?

//        ArrayList<String> phonesList = new ArrayList<>(Arrays.asList("Honor9", "Sony", "Pioneer", "Samsung", "Honor10", "Samsung", "Sony", "Huawei", "Apple", "Honor9"));
//        Set<String> phoneSet = new HashSet<>(phonesList); // создали HashSet - в нем могут сидеть только уникальные слова по определению
//        System.out.println(phoneSet); //вывели уникальные слова
//
//        for (String word : phoneSet) {   // пробежали по HashSet с помощью внутренней переменной, сохраняющей в себе значение каждой итерации
//            System.out.println((word + " : " + Collections.frequency(phonesList, word))); // вывели слова-количество повторений
//        }
//        System.out.println("*******************************************************************************");
//    }
/*

2. Написать простой класс «Телефонный Справочник», который хранит в себе список фамилий и телефонных номеров.
В этот телефонный справочник с помощью метода add() можно добавлять записи, а с помощью метода get() искать номер телефона по фамилии.
Следует учесть, что под одной фамилией может быть несколько телефонов (в случае однофамильцев),
тогда при запросе такой фамилии должны выводиться все телефоны.
*/
        Phonebook phonebook = new Phonebook();

        phonebook.add("Ivanov", "2424");
        phonebook.add("Ivanov", "59566");
        phonebook.add("Sidorov", "11111");
        phonebook.get("Ivanov");

    }
}
// Вопрос Слава (Просьба ответить на лекции всем): почему мне пришлось закоменить первое задание в Main, чтобы запустить второе про справочник?